<template>
  <div class="info" :class="infoClasses">
    <section class="info__text">
      <div>
        <Panel v-show="active === 0">
          <ScrollPanel style="height: 200px">
            Привет дорогой читатель. Ты попал на мою страницу визитку. И так. Меня зовут Павел, меня 24 года и я
            fullstack web developer. Как я к этому пришел? Сейчас расскажу.
          </ScrollPanel>
        </Panel>
        <ScrollPanel style="height: 200px" v-show="active === 1">
          Все началось со школы. Меня сильно нравилось возиться с компьютерами и телефонами. Я любил разбирать
          технику, менять комплектующие, собирать что-то из подручных средств. Потом в дело пошли разоборки с
          программной составляющей. Переустановить винду, поменять прошивку, выдать рут права. В старших классах в
          школе мы начали изучать html и css. Не могу сказать, что был в восторге, поэтому выполнял задания, но дальше
          в изучение не погружался. . Так к 11 классу я был твердно уверен, что хочу связать свою жизнь с техникой.
        </ScrollPanel>
        <ScrollPanel style="height: 200px" v-show="active === 2">
          Почти успешно сдав экзамены, я направился покорять столицу Красноярского края Поступил в Институт
          информационных и космических технологий. Там началось полноценное погружение в мир IT. И началось оно с C++.
          Было тяжело, но с каждым днем язык переставал быть помехой и спустя год я уже мог писать какой-то софт. Но
          писать софт было не интересно, захотелось создавать игры. Так я пришел к unity с c# на борту (Позже конечно
          c# появился и в институте). Сделав одну игру, похожую на paperPlease стало понятно, что без команды я далеко
          не уйду (Нужен сценарист, художник и так далее). А команда не собралась.В это время в институте мы начали
          изучать QT. Там в качестве курсовой была написана информационная система для аэропортов.
        </ScrollPanel>
        <ScrollPanel style="height: 200px" v-show="active === 3">
          После успешной сессии я решил спустится на уровень ниже, с игрой не получилось, попробую тогда движки. Я
          вооружился c++ и openGL и начал работать в этом направлении. Написал какое-то подобие кубика рубика и на
          этом остановился. Мне понравилось, но я решил посмотреть другие технологии. Так я пришел к нативным андроид
          приложениям. Научился работать с java, но с само приложение как-то не задалось, все упиралось в отсутствие
          идеи. Но java мне понравилась, поэтому я решил применить ее в другом секторе. А именно, написание модов для
          minecraft. И скажу честно - это было круто. Майнкрафт действительно игра мира. Там я познакомился с java
          полноценно и смог развернуться на полную катушку. Использовать базу данных, загружать новые ассеты. Благо, в
          институте был качественный курс по базам данных (MSSQL).
        </ScrollPanel>
        <ScrollPanel style="height: 200px" v-show="active === 4">
          к 3 курсу начало приходить понимание, что надо свою жизнь устраивать и искать работу. Посмотрел вакансии в
          своем городе и понял - я не актуален. Тогда я решил обратить внимание на веб-разработку, которую сознательно
          игнорировал. Как раз к тому моменту в институте началось изучение основ. Я не долго думая, запрыгнул в этот
          поезд. И начал погружаться в Веб. И, конечно, было тяжело, все совсем не так и по-другому, какие-то сервера,
          запросы, бекенд и фронтенд, ajax и кучу терминологии, которую я никак не мог понять. Благо, в институте была
          достаточно хорошо выстроена программа, мне этого хватило, чтобы двигаться дальше. Так я освоил HTML и CSS, а
          так же основы JS, которые мне уже позволяли верстать качественные и интерактивные страницы, но тут я понял,
          что мне нужен бекенд, из самого простого - NodeJS. Тут я уже разгулялся по полной программе, решил
          скопировать сайт, научился работать с шаблонизаторами (handlebars), понял как гонять запросы между
          фронтендом и бекендом, освоил веб-сокеты, потом в ход пошло изучение фрейморков, остановился я на Vue.JS,
          потому что у него самая лучшая и понятная документация, да и он мне понравился. Встал опять вопрос о поиске
          работы. Вышел на рынок и увидел. Нужен джуниор разработчик на полставки и половина стека, которую я изучаю,
          а вторая половина (php, laravel) была для меня темным лесом. Откликнулся, прошел софт собеседование. Мне
          предложили сделать тестовое задание и дали 2 недели. Я экстренно взялся за штурм php и laravel. php
          показался не сложным. В целом все тоже самое, что и C, только проще подумал я. А вот в laravel сходу
          погрузиться не получилось, потому что он используем много магии и неявностей, активно использует фишки PHP,
          а они мне непонятны. Но за 2-3 дня разных экспериментов, я начал соображать что к чему и как оно работает. Я
          написал тестовое задание и принял позу ждуна. Через неделю мне ответили, что разработчиков устроило мое
          тестовое и предложили перейти к следующему этапу. Ну в общем-то, так я и стал веб-разработчиком
        </ScrollPanel>
      </div>
    </section>
    <section class="info__steps">
      <Steps v-model:activeStep="active" :model="steps" :readonly="false"></Steps>
    </section>
    <section class="info__tech"></section>
  </div>
</template>

<script lang="ts" setup>

import {reactive, ref} from "vue";
const infoClasses = reactive<string[]>(['info_hidden']);
const steps = [
  { label: 'Приветствие' },
  { label: 'Школа' },
  { label: '1 Курс' },
  { label: '2 Курс' },
  { label: '3 Курс' },
  { label: 'Жизнь' },
];
const active = ref(0);
</script>

<style lang="scss">

.info {
  opacity: 1;
  transition: opacity 1s ease-out;
  &.info_hidden {
    opacity: 0;
  }
  display: grid;
  width: 70%;
  grid-template-columns: 1fr 200px;
  grid-template-rows: 1fr minmax(100px);
  gap: 16px;
  .info__text {
    grid-row: 1/1;
    grid-column: 1/1;
  }

  .info__steps {
    grid-row: 2/2;
    grid-column: 1/1;
  }
  .info__tech {
    grid-column: 1/1;
    grid-row: 1/2;
  }
}

</style>